/*Создание массива
Массив используется для хранения упорядоченной коллекции элементов. Он объявляется открывающей и закрывающей квадратной скобками [] - литералом массива. Внутри скобок каждый элемент массива разделяется запятой.

const planets = ["Earth", "Mars", "Venus"];
Полезно
При объявлении переменной для объекта или массива программисты обычно используют const. Они делают это для того, чтобы случайно не перезаписать значение, т.к. попытка перезаписи вызовет ошибку до того как код попадет к пользователю.

Задание
Объяви переменную fruits и присвой ей массив фруктов - строк "apple", "plum", "pear" и "orange".

Тесты
Объявлена переменная fruits
Значение переменной fruits это массив ["apple", "plum", "pear", "orange"] */


const fruits = ['apple', 'plum', 'pear', 'orange'];